import React from 'react';
import { Link } from 'react-router-dom';
import '../styles/Cookies.css'; // Import your CSS file for styling

const Cookies = () => {
  return (
    <div className="cookies">
      <div className="cookies-box">

      <h1>Бисквитки</h1>
        <div>За да работи този сайт както трябва, понякога запазваме на вашето устройство малки файлове с данни, наричани бисквитки.</div>
        <h2>Какво представляват бисквитките?</h2>
        <div>Бисквитките са малки текстови файлове, които се запазват на вашия компютър или мобилно устройство, когато посещавате даден уебсайт. Те позволяват на уебсайта да запаметява вашите действия и предпочитания (като например потребителско име, език, размер на шрифта и други настройки за показване) за определен период от време, за да не се налага да ги въвеждате всеки път, когато посещавате сайта или преминавате от една страница към друга.</div>
        <h2>По какъв начин използваме бисквитките?</h2>
        <div>
            Бисквитките се използват за адаптиране съдържанието на уеб сайтa към желанията на даден потребител. Тази страница автоматично събира информация за някои елементи на хардуера и софтуера на вашия компютър. Тази информация може да включва: вашия IP адрес, вид браузър, резюлюция на монитора ви, часове на достъп до сайта ни и посетените от вас уеб страници.<br/>
            Горепосочената информация се използва единствено с цел подобрено функциониране на сайта.<br/>
            Тази страница показва реклами от трети лица. Тези реклами използват бисквитки (cookies) за да записват и четат информация на Вашия браузър. Бисквитките, използвани от партньори на един уебсайт, са обект на техни собствени политики за поверителност. За да предотвратите записването на бисквитки на вашия компютър, моля забранете записа на бисквитки, чрез промяна настройките на браузъра.<br/>
            Възможно е някои от рекламите от трети лица, публикувани тук да използват информация относно посещенията Ви на този и други уебсайтове с цел да показват реклами за стоки и услуги, които може да представляват интерес за Вас. Ако искате да получите повече информация за тази практика и да научите с какъв избор разполагате, за да не се използват тези данни от съответните рекламни фирми посетете следните линкове:<br/>
            <a target="_blank" href="https://www.google.com/policies/technologies/ads/">https://www.google.com/policies/technologies/ads/</a>
            <br/>
            <a target="_blank" href="https://www.google.com/intl/bg/policies/privacy/">https://www.google.com/intl/bg/policies/privacy/</a>
        </div>
        <h2>Как да контролирате бисквитките</h2>
        <div>
            Можете да контролирате и/или изтривате бисквитки когато пожелаете – за повече информация вижте <a target="_blank" href="http://aboutcookies.org">aboutcookies.org</a>
            или <a target="_blank" href="http://www.allaboutcookies.org">allaboutcookies.org</a>
            .<br/>
            За да се откажете от проследяването от Google Анализ във всички уебсайтове посетете <a target="_blank" href="http://tools.google.com/dlpage/gaoptout">http://tools.google.com/dlpage/gaoptout</a>
            .<br/>Можете да изтриете всички бисквитки, които вече са запазени на вашия компютър, а също така можете да настроите повечето браузъри да ги блокират. Ако направите това обаче, може да се наложи ръчно да настройвате някои параметри всеки път, когато посещавате даден сайт, а освен това е възможно някои услуги и функции да не работят.
        </div>
        <br/> 
        <div className='cookies-back'>
          <Link to="/">Разбрах, върни ме назад</Link>
        </div>
        <br/>
        <br/>

      </div>
    </div>
  );
}

export default Cookies;
