import React, { useEffect } from 'react';
import { Link } from 'react-router-dom';
import '../styles/PrivacyPolicy.css'; // Import your CSS file for styling

const PrivacyPolicy = () => {
        useEffect(() => {
                window.scrollTo(0, 0);
        }, []); 
  return (
    <div className="privacy-policy">
      <div className="privacy-policy-box">

      <h1 class="ipsType_pageTitle">Декларация за поверителност</h1>
        <h2>Кой сме ние?</h2>
        Сайтът <a href="https://klasirane.com" target="_blank" rel="external nofollow noopener">https://Klasirane.com</a>
        е собственост и се обслужва от <a href="mailto:contact@klasirane.com">Станислав Димитров</a>
        .
<h2>Какво е GDPR?</h2>
        Общият регламент за защита на данните (GDPR) е приет още през 2016г., но влиза в сила на 25 май 2018г.<br/>
        Регламентът има за цел да уеднакви и актуализира съществуващите регулации за защита на личните данни в целия Европейски съюз, като се цели промяна в начина, по който организациите боравят с тях. След 25 май 2018, всички граждани на ЕС ще имат пълен контрол над данните, които предоставят на различните организации.<br/>
        GDPR защитава правата за поверителност на данните на всеки човек, който е в ЕС, без значение дали информацията се обработва в рамките на Европейския съюз или извън него.
<h2>Какви лични данни събираме и защо го събираме</h2>
        Klasirane.com гарантира сигурността и конфиденциалността на предоставените данни и предавани чрез компютърната ни система.<br/>
        Данните и личната информация, предоставена от ПОТРЕБИТЕЛИ, се използва от Klasirane.com за статистически данни или реклама.<br/>
        Когато посетите уебсайта, където Klasirane.com публикува реклами, съдържание или анализи, Klasirane.com може да постави cookie във вашия уеб браузер. Един модул cookie е ниско количество съхранена информация на компютъра, с цел да идентифицира браузерът по време на взаимодействие с уеб сайтове. Модулите cookie могат да бъдат използвани с цел съхраняване на елементи, като идентификатори или потребителски предпочитания. Един уеб сайт може да постави модул cookie за съхраняване в браузъра ако настройките на браузъра позволяват това.<br/>
        Един браузър може да позволи на определен уеб сайт да има достъп до модулите cookie, и да откаже такъв достъп на други сайтове.<br/>
        <br/>
        Можете да конфигурирате браузъра за достъп на всички модули cookie, за отхвърляне на всички модули cookie или да Ви информираме тогава когато е поставен модул cookie. Браузърите се различават помежду си, и поради това Ви молим да се обърнете към менюто „Помощ“ на вашия браузър, за да научите начина за промяната на cookie.<br/>
        <h3>Бисквитки</h3>
        <strong>Рекламни бисквитки</strong>
        <br/>
        Тези бисквитки използват информация за начина, по който използвате нашите сайтове - страниците, които посещавате или начина, по който реагирате на реклами, за да Ви предоставим реклами, които са съобразени с Вашите предпочитания – както на нашия сайт, така и извън него.<br/>
        Чрез рекламните бисквитки се реализира и "рекламирането, базирано на интересите". При него се анализира не само поведението на нашите сайтове и апликации, но и на други такива, при което се изгражда Ваш профил.<br/>
        Отчита се какви и колко реклами сте видели, на кои сайтове/апликации, какви действия сте предприели спрямо рекламите.<br/>
        Много от тези видове бисквитки принадлежат на трети страни – наши доставчици на услуги. За рекламодатели, които са трети страни, вижте повече информация по-долу.<br/>
        <br/>
        <strong>Как използваме рекламните бисквитки?</strong>
        <br/>
        Използваме тези бисквитки, за да подбираме и сервираме най-подходящи за Вашите интереси реклами и персонализирани препоръки.<br/>
        Ние (и упълномощени трети страни) можем да използваме неперсонализирана информация както от постоянните, така и от сесийните бисквитки за статистически цели, както следва:<br/>
        • За да определим кои са най-популярните части на нашия Сайт.<br/>
        • За да наблюдаваме употребата на нашите Услуги и нашия Сайт (честота и време).<br/>
        • За да предоставяме анонимна информация на трети страни, така че към Вас да бъде насочвана по-подходяща реклама.<br/>
        • За да следим успеха на дадени продукти.<br/>
        • За да определяме колко често Вие и други потребители посещавате нашия Сайт и закупувате продукти.<br/>
        • За да провеждаме анкети, така че да подобрим взаимодействието Ви с нашия Сайт и с нас като цяло.<br/>
        <br/>
        Ако не сте влезли в регистрираните си профили, има голяма вероятност тези бисквитки да не могат да идентифицират субект на данни – физическо лице. Ние ги използваме само за измерване на посещенията, например колко пъти сте посетили дадена страница. Ако сте влезли в регистрирания си профил, можем да комбинираме данните от профила ви с тези бисквитки и да Ви идентифицираме.
<h3>Вградено съдържание от други уебсайтове</h3>
        Статиите в този сайт могат да включват вградено съдържание (например видеоклипове, изображения, статии и др.). Вграденото съдържание от други уебсайтове се държи по същия начин, както ако посетителят е посетил другия уебсайт.<br/>
        Тези уебсайтове могат да събират данни за вас, да използват "бисквитки", да интегрират допълнително проследяване от трети страни и да наблюдават взаимодействието ви с вграденото съдържание, включително проследяване на взаимодействието ви с вграденото съдържание, ако имате профил и сте влезли в него.
<h3>Анализ</h3>
        Използваме Google Analytics <a href="https://policies.google.com/privacy?hl=bg" target="_blank" rel="external nofollow noopener">https://policies.google.com/privacy?hl=bg</a>
        за отчитане и анализ на броя посещения.  Този уебсайт може да събира данни за вас, да използва "бисквитки" и да наблюдава взаимодействието ви с нашия сайт.<br/>
        <h2>С кого споделяме вашите данни</h2>
        Публикуваната в сайта лична информация не се споделя с трети страни.<br/>
        <h2>Какви права имате върху данните си</h2>
        Ако имате профил в този сайт и сте добавили постове, можете да поискате да получите експортиран файл с личните данни, които държим за вас, включително всички данни, които сте ни предоставили.
<h2>Информация за контакт</h2>
        Кристиан Димитров, Email: kris.dimitrov@gmail.com
<h3>Как защитаваме вашите данни</h3>
        Klasirane.com обработва Вашите лични данни само в съответствие с посочените по-горе цели и срокове. Сайтът ни е с високо ниво на сигурност. Сайтът ни е хостнат на собствен сървър.<br/>
        Осигуряваме максимална защита на регистрираните, когато ни предоставят своите данни. Klasirane.com няма да разпространя Ваши лични данни без Ваше изрично съгласие. След изтичане на срока за обработване на личните Ви данни, ние ще ги изтрием по траен начин и няма да ги използваме в бъдеще, освен ако не е налице Ваше изрично съгласие.<br/>
        Профилите ви имат допълнителни защити, като "хеширане" на паролите - това е вид криптиране, чрез което дори администраторите не могат да видят и разберат вашата парола запазена в базата данни.
<div></div>
        <h1>Бисквитки</h1>
        <div>За да работи този сайт както трябва, понякога запазваме на вашето устройство малки файлове с данни, наричани бисквитки.</div>
        <h2>Какво представляват бисквитките?</h2>
        <div>Бисквитките са малки текстови файлове, които се запазват на вашия компютър или мобилно устройство, когато посещавате даден уебсайт. Те позволяват на уебсайта да запаметява вашите действия и предпочитания (като например потребителско име, език, размер на шрифта и други настройки за показване) за определен период от време, за да не се налага да ги въвеждате всеки път, когато посещавате сайта или преминавате от една страница към друга.</div>
        <h2>По какъв начин използваме бисквитките?</h2>
        <div>
            Бисквитките се използват за адаптиране съдържанието на уеб сайтa към желанията на даден потребител. Тази страница автоматично събира информация за някои елементи на хардуера и софтуера на вашия компютър. Тази информация може да включва: вашия IP адрес, вид браузър, резюлюция на монитора ви, часове на достъп до сайта ни и посетените от вас уеб страници.
Горепосочената информация се използва единствено с цел подобрено функциониране на сайта.
Тази страница показва реклами от трети лица. Тези реклами използват бисквитки (cookies) за да записват и четат информация на Вашия браузър. Бисквитките, използвани от партньори на един уебсайт, са обект на техни собствени политики за поверителност. За да предотвратите записването на бисквитки на вашия компютър, моля забранете записа на бисквитки, чрез промяна настройките на браузъра.
Възможно е някои от рекламите от трети лица, публикувани тук да използват информация относно посещенията Ви на този и други уебсайтове с цел да показват реклами за стоки и услуги, които може да представляват интерес за Вас. Ако искате да получите повече информация за тази практика и да научите с какъв избор разполагате, за да не се използват тези данни от съответните рекламни фирми посетете следните линкове:
<a href="https://www.google.com/policies/technologies/ads/" target="_blank" rel="noopener">https://www.google.com/policies/technologies/ads/</a>
            <a href="https://www.google.com/intl/bg/policies/privacy/" target="_blank" rel="noopener">https://www.google.com/intl/bg/policies/privacy/</a>
        </div>
        <h2>Как да контролирате бисквитките</h2>
        <div>
            Можете да контролирате и/или изтривате бисквитки когато пожелаете – за повече информация вижте <a href="http://aboutcookies.org/" target="_blank" rel="noopener">aboutcookies.org</a>
            или <a href="http://www.allaboutcookies.org/" target="_blank" rel="noopener">allaboutcookies.org</a>
            .
За да се откажете от проследяването от Google Анализ във всички уебсайтове посетете <a href="http://tools.google.com/dlpage/gaoptout" target="_blank" rel="noopener">http://tools.google.com/dlpage/gaoptout</a>
            .
Можете да изтриете всички бисквитки, които вече са запазени на вашия компютър, а също така можете да настроите повечето браузъри да ги блокират. Ако направите това обаче, може да се наложи ръчно да настройвате някои параметри всеки път, когато посещавате даден сайт, а освен това е възможно някои услуги и функции да не работят.
        </div>
        <br/>
        <div className='privacy-back'>
          <Link to="/">Разбрах, върни ме назад</Link>
        </div>
        <br/>
        <br/>

      </div>
    </div>
  );
}

export default PrivacyPolicy;
